ezois_ka/oooezoiskaobmen/src/Catalogs/ДокументыРеализацииПолномочийНалоговыхОрганов/ДокументыРеализацииПолномочийНалоговыхОрганов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДокументыРеализацииПолномочийНалоговыхОрганов</name>
  <attributes>
    <name>НалоговыйОрган</name>
    <type>
      <types>CatalogRef.НалоговыеОрганы</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <comment>Вид налогового документа</comment>
    <type>
      <types>EnumRef.ВидыНалоговыхДокументов</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСообщения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантДолжность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>45</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>182</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ПредметЦиклаОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРешенияНаЖалобу</name>
    <type>
      <types>EnumRef.ВидыРешенийНаЖалобу</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖалобы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЖалобы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидУведомления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерУведомления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУведомления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РНПТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>45</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСобственника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОСобственника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИННСобственника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КППСобственника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОшибкиНСП</name>
    <attributes>
      <name>КодОшибки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстОшибки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ezois_ka/oooezoiskaobmen/src/InformationRegisters/СвойстваОтветовНаТребования/СвойстваОтветовНаТребования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвойстваОтветовНаТребования</name>
  <attributes>
    <name>ДатаОтвета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтветаИзмененная</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправкиТребования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодтверждения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДнейДоОтвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьКритическаяОшибкаОтвета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КалендарьБылНезаполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОтветов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветитьДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветНеПринят</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодтвердитьДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетОтвета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалосьРазобратьPDF</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветУжеДан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплаты</name>
    <comment>Срок оплаты для КНД 1160001</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТребования</name>
    <comment>Служебные данные</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭДООбязателен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветилиНаВопросПроЭДО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>CatalogRef.ДокументыРеализацииПолномочийНалоговыхОрганов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ezois_ka/oooezoiskaobmen/src/InformationRegisters/ЖурналОтправокВКонтролирующиеОрганы/ЖурналОтправокВКонтролирующиеОрганы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналОтправокВКонтролирующиеОрганы</name>
  <resources>
    <name>СтатусОтправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВидКонтролирующегоОргана</name>
    <type>
      <types>EnumRef.ТипыКонтролирующихОрганов</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьКритическиеОшибкиОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтвет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПриcоединенныйФайл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодКонтролирующегоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеОтправляетсяВКонтролирующийОрган</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Непрочтенное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеКонтролирующегоОргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Скрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеСдачиОтчетности</name>
    <type>
      <types>EnumRef.СостояниеСдачиОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.ВидыДокументовВЖурнале</types>
    </type>
  </attributes>
  <dimensions>
    <name>СтраницаЖурнала</name>
    <type>
      <types>EnumRef.СтраницыЖурналаОтчетность</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ezois_ka/oooezoiskaobmen/src/Catalogs/ДокументыРеализацииПолномочийНалоговыхОрганов/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Перем КонтекстЭДОКлиент;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоНовый = Параметры.Ключ.Пустая();
	Если ЭтоНовый Тогда
		ТекстПредупреждения = НСтр("ru = 'Копирование входящих сообщений запрещено!'");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// инициализируем контекст ЭДО - модуль обработки
	ТекстСообщения = "";
	КонтекстЭДОСервер = ДокументооборотСКО.ПолучитьОбработкуЭДО(ТекстСообщения);
	Если КонтекстЭДОСервер = Неопределено Тогда 
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганами.ОтметитьКакПрочтенное(Объект.Ссылка);
	
	ОпределитьВидДокумента(КонтекстЭДОСервер);
	ИзвлечьДанныеТребования();

	ИнициализироватьОбязательностьЭДО();
	
	ИнициализироватьВыводСтатусовИВажныхСообщений_85();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(ТекстПредупреждения) Тогда 
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриОткрытииЗавершение", ЭтотОбъект);
	ДокументооборотСКОКлиент.ПолучитьКонтекстЭДО(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// При записи ответа необходимо перерисовать количество ответов в панели требования. 
	Если ИмяСобытия = "Запись_ОписиИсходящихДокументовВНалоговыеОрганы" 
		И ТипЗнч(Источник) = Тип("СправочникСсылка.ОписиИсходящихДокументовВНалоговыеОрганы")
		ИЛИ	ИмяСобытия = "Запись_ПоясненияКДекларацииПоНДС" 
		И ТипЗнч(Источник) = Тип("ДокументСсылка.ПоясненияКДекларацииПоНДС")
		ИЛИ	ИмяСобытия = "Запись_ПерепискаСКонтролирующимиОрганами" 
		И ТипЗнч(Источник) = Тип("СправочникСсылка.ПерепискаСКонтролирующимиОрганами")
		ИЛИ	ТипЗнч(Источник) = Тип("ДокументСсылка.УведомлениеОСпецрежимахНалогообложения")
		ИЛИ	СтрНайти(Врег(ИмяСобытия), НСтр("ru = 'ОТПРАВ'")) Тогда
		
		ОбновитьТекущееСостояниеДокумента();
		
	КонецЕсли;
	
	Если РегламентированнаяОтчетностьКлиент.ЭтоСобытиеЗавершениеОтправки(ИмяСобытия) Тогда
		ВывестиСтатусыИВыжныеСообщенияНаФормуНаСервере();	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_ДокументыРеализацииПолномочийНалоговыхОрганов", , Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СсылкаСрокиНажатие(Элемент)
	
	ТребованияФНСКлиент.ПоказатьИнформациюоСроках();
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийЭтапаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ТребованияФНСКлиент.ПриКликеНаСсылкуВПанелиОтправки(
		ЭтотОбъект, 
		Объект.Организация, 
		НавигационнаяСсылкаФорматированнойСтроки, 
		СтандартнаяОбработка);

КонецПроцедуры
	
&НаКлиенте
Процедура НеЗаполненКалендарьРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	ТребованияФНСКлиент.ОткрытьКалендарь(СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура НеУдалосьРазобратьPDFРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	ТребованияФНСКлиент.ОткрытьКалендарь(СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Функция ЭтоXML(ИмяФайла) Экспорт
	
	Возврат Прав(ВРег(ИмяФайла), 4) = ".XML";
					
КонецФункции

&НаКлиенте
Процедура ГиперссылкаПротоколНажатие(Элемент)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьПротоколИзПанелиОтправки(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаОтветыНажатие(Элемент)
	КонтекстЭДОКлиент.НажатиеНаКнопкуПоказатьОтветыПоТребованию(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыОтправкиНажатие(Элемент)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьСостояниеОтправкиИзПанелиОтправки(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура КритическиеОшибкиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьКритическиеОшибкиИзПанелиОтправки(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеДокументаОснованияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(,Объект.ДокументОснование);

КонецПроцедуры

&НаКлиенте
Процедура ПлатежиПриАктивизацииСтроки(Элемент)
	
	#Если ВебКлиент Тогда
		ПодключитьОбработчикОжидания("СнятьВыделениеСтроки", 0.1, Истина);
	#Иначе
		СнятьВыделениеСтроки();
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПлатежиПометкаПриИзменении(Элемент)

	СуммаУплаты = 0;
	Для Каждого СтрокаТаблицы Из Платежи Цикл
		СуммаУплаты = СуммаУплаты + ?(СтрокаТаблицы.Пометка, СтрокаТаблицы.Сумма, 0);
	КонецЦикла;
	ПодробностиОплаты = СтроковыеФункцииКлиент.ФорматированнаяСтрока(ПолучитьПредставлениеУплаты(ДанныеТребования.Сумма, СуммаУплаты));
	Элементы.СформироватьПлатеж.Доступность = СуммаУплаты <> 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаПроизведенаПриИзменении(Элемент)
	
	ЗаписатьИзмененияТребования(Неопределено, ОплатаПроизведена);
	НачальноеОтображениеТребований(Платежи.Количество() = 1 И ЗначениеЗаполнено(ДанныеТребования.ДатаПлатежа));
	Оповестить("Запись_ДокументыРеализацииПолномочийНалоговыхОрганов", , Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПлатежкиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ИщемКлюч = НСтр("ru = 'ПлатежноеПоручениеФорма'");
	Если СтрНачинаетсяС(НавигационнаяСсылкаФорматированнойСтроки, ИщемКлюч) Тогда
		СтандартнаяОбработка = Ложь;
		ОткрылиФорму = Ложь;
		ТекущийСчетчик = Число(Сред(НавигационнаяСсылкаФорматированнойСтроки, СтрДлина(ИщемКлюч) + 1));
		ВсеДокументы = ПолучитьСсылкиПлатежныхПоручений();
		ПараметрыФормы = Новый Структура("Ключ", ВсеДокументы[ТекущийСчетчик].Ссылка);
		ДокументооборотСКОКлиентПереопределяемый.ОткрытьПлатежноеПоручениеТребования(ПараметрыФормы, ОткрылиФорму);
		Если ОткрылиФорму <> Истина Тогда
			ПоказатьЗначение(Неопределено, ВсеДокументы[ТекущийСчетчик].Ссылка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтветыНажатие(Элемент)
	
	КонтекстЭДОКлиент.НажатиеНаКнопкуПоказатьОтветыПоТребованию(Объект.Ссылка, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВложенияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИмяФайла = НавигационнаяСсылкаФорматированнойСтроки;
	
	Результат = ПолучитьВложениеНаСервере(ИмяФайла);
	Если ЗначениеЗаполнено(Результат.ТекстПредупреждения) Тогда 
		ПоказатьПредупреждение(, Результат.ТекстПредупреждения);
	ИначеЕсли Результат.ВАрхиве Тогда 
		КонтекстЭДОКлиент.ПоказатьУведомлениеАрхивныхФайлов(, 9, 3, Истина);
		Возврат;
	ИначеЕсли ЭтоXML(ИмяФайла) Тогда
		Текст = ТекстСообщения(Результат.АдресДанных);
		ДокументооборотСКОКлиент.ПоказатьВходящееИзвещениеФНС(ЭтотОбъект, Текст);
	Иначе
		ОперацииСФайламиЭДКОКлиент.ОткрытьФайл(Результат.АдресДанных, ИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
	
&НаКлиенте
Процедура ПодтвердитьЧтоЭДООбязателен(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПослеПодтвержденияЧтоЭДООбязателен", 
		ЭтотОбъект); 
		
	ТребованияФНСКлиент.ОткрытьФормуПодтвержденияВыбораОбязательностиЭДО(Истина, Объект.Ссылка, Объект.Организация, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьЧтоЭДОНеОбязателен(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПослеПодтвержденияЧтоЭДООбязателен", 
		ЭтотОбъект); 
	
	ТребованияФНСКлиент.ОткрытьФормуПодтвержденияВыбораОбязательностиЭДО(Ложь, Объект.Ссылка, Объект.Организация, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКСверкеИмущественногоНалога(Команда)
	
	ДокументооборотСКОКлиентПереопределяемый.ПерейтиКСверкеПоИмущественномуНалогу(ЭтотОбъект, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ПечатнаяФормаДокументаНО = ТабличныйДокументНО(Объект.Ссылка);
	КонтекстЭДОКлиент.НапечататьДокумент(ПечатнаяФормаДокументаНО, Объект.Наименование);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыгрузитьВложения(Команда)
	
	СохранитьВложения();

КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьОтвет(Команда)
	
	КонтекстЭДОКлиент.СоздатьОтветНаДокументРеализацииПолномочий(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодтвердитьПрием(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПослеПодтвержденияПриемаИлиОтказаВПриеме", 
		ЭтотОбъект);
		
	КонтекстЭДОКлиент.СоздатьРезультатПриемаВходящейОписиИнтерактивноПоДокументуОписи(Объект.Ссылка, Истина, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтказатьВПриеме(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПослеПодтвержденияПриемаИлиОтказаВПриеме", 
		ЭтотОбъект);
	
	КонтекстЭДОКлиент.СоздатьРезультатПриемаВходящейОписиИнтерактивноПоДокументуОписи(Объект.Ссылка, Ложь, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтправку(Команда)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОбновитьОтправкуИзПанелиОтправки(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНеотправленноеИзвещение(Команда)
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОтправитьНеотправленноеИзвещениеИзПанелиОтправки(ЭтаФорма);
КонецПроцедуры
	
&НаКлиенте
Процедура ЗапроситьСверку(Команда)
	
	КонтекстЭДОКлиент.СоздатьЗапросНаСверку(
		Объект.Организация, 
		ПредопределенноеЗначение("Перечисление.ВидыУслугПриИОН.ПустаяСсылка"));
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДатуОтвета(Команда)
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("ИзменитьДатуОтветаЗавершение", ЭтотОбъект);
	ТребованияФНСКлиент.ИзменитьСрокТребования(Объект.Ссылка, ОповещениеЗавершения);
	ТекущийЭлемент = Элементы.Комментарий;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПлатежноеПоручение(Команда)
	
	ОткрытьФормуФормированияПлатежей();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьПлатеж(Команда)
	
	МассивПлатежей = Новый Массив;
	Для Каждого СтрокаМассива Из ПолучитьСсылкиПлатежныхПоручений() Цикл
		МассивПлатежей.Добавить(СтрокаМассива.Ссылка);
	КонецЦикла;
	
	ДокументооборотСКОКлиентПереопределяемый.СформироватьВыгрузкуПлатежныхПоручений(ЭтотОбъект, МассивПлатежей);
	
КонецПроцедуры

&НаКлиенте
Процедура КакУзнать(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"КакУзнать_Завершение", 
		ЭтотОбъект);
	
	ТребованияФНСКлиент.ОткрытьТестНаОбязательностьЭДО(
		Объект.Организация, 
		ОписаниеОповещения, 
		Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьВложениеНаСервере(ИмяФайла)
	
	Результат = Новый Структура("ТекстПредупреждения, АдресДанных, ВАрхиве", "",, Ложь);
	
	ТекстСообщения = "";
	КонтекстЭДОСервер = ДокументооборотСКО.ПолучитьОбработкуЭДО(ТекстСообщения);
	Если КонтекстЭДОСервер = Неопределено Тогда 
		Результат.ТекстПредупреждения = ТекстСообщения;
		Возврат Результат;
	КонецЕсли;
	
	// получаем вложение
	СтрВложения = КонтекстЭДОСервер.ПолучитьФайлыДокументовРеализацииПолномочийНалоговыхОрганов(Объект.Ссылка, ИмяФайла);
	Если СтрВложения.Количество() = 0 Тогда
		Результат.ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Вложение с именем  %1 не обнаружено.'"), Символ(34) + ИмяФайла + Символ(34));
		Возврат Результат;
	КонецЕсли;
	
	Вложение = СтрВложения[0];
	
	Если Вложение.ВАрхиве Тогда 
		Результат.ВАрхиве = Истина;
		Возврат Результат;
	КонецЕсли;
	
	Адрес = ПоместитьВоВременноеХранилище(Вложение.Данные.Получить(), УникальныйИдентификатор);
	Результат.АдресДанных = Адрес;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПроверитьВложения(Всего, ВАрхиве)
	
	КонтекстМодуля = ДокументооборотСКО.ПолучитьОбработкуЭДО();
	ВложенияОснования = КонтекстМодуля.ПолучитьФайлыДокументовРеализацииПолномочийНалоговыхОрганов(Объект.Ссылка);
	
	Всего = 0;
	ВАрхиве = 0;
	
	Для Каждого Вложение Из ВложенияОснования Цикл 
		ВАрхиве = ВАрхиве + ?(Вложение.ВАрхиве, 1, 0);
		Всего = Всего + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВложения()
	
	МассивИменВложений = Новый Массив;
	Для Каждого Элемент Из Вложения Цикл
		МассивИменВложений.Добавить(Элемент.Значение.ИмяФайла);
	КонецЦикла;
	
	Если МассивИменВложений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Всего = 0;
	ВАрхиве = 0;
	ПроверитьВложения(Всего, ВАрхиве);
	
	ВхПараметры = Новый Структура("МассивИменВложений", МассивИменВложений);
	
	Если ВАрхиве > 0 Тогда 
		ВсеВАрхиве = ?(ВАрхиве = Всего, 1, 0);		
		Описание = Новый ОписаниеОповещения("СохранитьВложенияПослеПроверкиЗавершение", ЭтотОбъект, ВхПараметры);
		КонтекстЭДОКлиент.ПоказатьУведомлениеАрхивныхФайлов(Описание, 18 + ВсеВАрхиве, 0, ?(ВсеВАрхиве = 1, Истина, Ложь));
		Возврат;
	КонецЕсли;
	
	СохранитьВложенияПослеПроверкиЗавершение(КодВозвратаДиалога.Да, ВхПараметры);
			
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВложенияПослеПроверкиЗавершение(Результат, ВхПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда 
		
		МассивОписанийПолучаемыеФайлы = ПолучитьМассивОписанийФайловВложений(ВхПараметры.МассивИменВложений);
		ОперацииСФайламиЭДКОКлиент.СохранитьФайлы(МассивОписанийПолучаемыеФайлы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	КонтекстЭДОКлиент = Результат.КонтекстЭДО;
	Если КонтекстЭДОКлиент = Неопределено Тогда 
		Закрыть();
	КонецЕсли;

	Сейчас = ТекущаяДата();
	УправлениеЭУ();
	
	ПодключитьОбработчикОжидания("РаспознатьСодержимоеТребования", 0.1, Истина);

КонецПроцедуры

&НаСервере
Процедура ИнициализироватьОбязательностьЭДО()
	
	ОбязательностьЭДОНеОпределена = ТребованияФНСВызовСервера.ОбязательностьЭДОНеОпределена(Объект.Ссылка);
	
КонецПроцедуры

#Область РазделТребованиеНаУплату

&НаКлиенте
Процедура ОткрытьФормуФормированияПлатежей()
	
	МассивПлатежей = Новый Массив;
	Для Каждого СтрокаТаблицы Из Платежи Цикл
		Если НЕ СтрокаТаблицы.Пометка Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Новый Структура;
		НоваяСтрока.Вставить("Сумма", СтрокаТаблицы.Сумма);
		НоваяСтрока.Вставить("КБК", СтрокаТаблицы.КБК);
		НоваяСтрока.Вставить("ОКТМО", СтрокаТаблицы.ОКТМО);
		НоваяСтрока.Вставить("УИН", СтрокаТаблицы.УИН);
		НоваяСтрока.Вставить("Пометка", СтрокаТаблицы.Пометка);
		МассивПлатежей.Добавить(НоваяСтрока);
	КонецЦикла;
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("СформироватьПлатежноеПоручениеЗавершение", ЭтотОбъект);
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ПараметрыФормы.Вставить("КонтролирующийОрган", Объект.НалоговыйОрган);
	ПараметрыФормы.Вставить("ДокументКО", Объект.Ссылка);
	ПараметрыФормы.Вставить("Платежи", МассивПлатежей);
	ПараметрыФормы.Вставить("ДанныеТребования", ДанныеТребования);
	ПараметрыФормы.Вставить("СоздатьСразу", Истина);
	ОткрытьФорму("Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов.Форма.ФормированиеОплаты", ПараметрыФормы, ЭтотОбъект, , , , ОповещениеЗавершения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура РаспознатьСодержимоеТребования()
	
	НачальноеОтображениеТребований();
	
	Если ДанныеТребования <> Неопределено Тогда
		Возврат;
	ИначеЕсли НЕ ЭтоТребованиеУплаты Тогда
		ДанныеТребования = "НеНужно";
		Возврат;
	КонецЕсли;
		
	АдресДанных = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	ТекущаяОперация = РаспознатьСодержимоеТребованияСервер(АдресДанных);
	ОповещениеЗавершения = Новый ОписаниеОповещения("РаспознатьСодержимоеТребованияЗавершение", ЭтотОбъект, Новый Структура("АдресДанных", АдресДанных));
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТекущаяОперация, "Статус") = "Выполняется" Тогда
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		ДлительныеОперацииКлиент.ОжидатьЗавершение(
			ТекущаяОперация, ОповещениеЗавершения, ПараметрыОжидания);
	Иначе
		ВыполнитьОбработкуОповещения(ОповещениеЗавершения, ТекущаяОперация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачальноеОтображениеТребований(РазборСодержимого = Ложь)
	
	Если Платежи.Количество() > 0 И НЕ РазборСодержимого Тогда
		Элементы.Платежи.ТекущаяСтрока = Платежи[0].ПолучитьИдентификатор();
	Иначе
		Элементы.Платежи.ТекущаяСтрока = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспознатьСодержимоеТребованияЗавершение(ТекущаяОперация, ДополнительныеПараметры) Экспорт
	
	РезультатРазбора = ПолучитьИзВременногоХранилища(ДополнительныеПараметры.АдресДанных);
	СохраненныеДанные = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатРазбора, "ДополнительныеДанные");
	ОбработатьДанныеТребования(СохраненныеДанные);
	
	ИзвлечьДанныеТребования();
	ОформитьСрокиПредставления();
	НачальноеОтображениеТребований(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПлатежноеПоручениеЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатВыбора) Тогда
		Для Каждого СтрокаМассива Из РезультатВыбора Цикл
			ДанныеТребования.Ссылки.Добавить(СтрокаМассива);
		КонецЦикла;
		
		Всего = ДанныеТребования.Платежи.ВГраница();
		Для Счетчик = 0 По Всего Цикл
			ТекущаяСтрока = Платежи.НайтиСтроки(Новый Структура("НомерВМассиве", Всего - Счетчик));
			Если ТекущаяСтрока.Количество() = 1 И ТекущаяСтрока[0].Пометка Тогда
				ДанныеТребования.Платежи.Удалить(Всего - Счетчик);
			КонецЕсли;
		КонецЦикла;
		ЗаписатьИзмененияТребования(ДанныеТребования, Истина);
		Оповестить("Запись_ДокументыРеализацииПолномочийНалоговыхОрганов", , Объект.Ссылка);
		
		#Если ВебКлиент Тогда
			Элементы.ДекорацияПлатежки.Заголовок = 
				Новый ФорматированнаяСтрока(Элементы.ДекорацияПлатежки.Заголовок, Символы.ПС);
		#КонецЕсли
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОформитьПредставлениеУплаты(Состояние)
	
	Просрочено = ЗначениеЗаполнено(Состояние.СрокОплаты) И НачалоДня(ТекущаяДатаСеанса()) > Состояние.СрокОплаты;
	
	Результат = "";
	ПредставлениеСрока = "";
	ПредставлениеДокументов = "";
	КоличествоПлатежек = 0;
	ВыбраннаяСумма = 0;
	Если ТипЗнч(ДанныеТребования) = Тип("Структура") Тогда 
		КоличествоПлатежек = ДанныеТребования.Ссылки.Количество();
		Для Каждого СтрокаМассива Из ДанныеТребования.Платежи Цикл
			ВыбраннаяСумма = ВыбраннаяСумма + ?(СтрокаМассива.Пометка, СтрокаМассива.Сумма, 0);
		КонецЦикла;
	КонецЕсли;
	
	Результат = ПолучитьПредставлениеУплаты(Состояние.Сумма, ?(Платежи.Количество() > 1 ИЛИ КоличествоПлатежек > 0 , ВыбраннаяСумма, Неопределено));
	
	Если НЕ ЗначениеЗаполнено(Состояние.Сумма) Тогда
		Элементы.ГруппаОплаты.Видимость = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Состояние.СрокОплаты) Тогда
		Разница = (НачалоДня(ТекущаяДатаСеанса()) - Состояние.СрокОплаты) / (60*60*24);
		ПредставлениеСрока = НСтр("ru = 'Срок:'") + " " 
			+ "<span style=""font:ШрифтЖирныйБРО"">" + НСтр("ru = 'до '")
			+ Формат(Состояние.СрокОплаты, "ДЛФ=D") + "</span>.";
		Если НЕ Состояние.ОтветУжеДан Тогда
			Если Разница > 0 Тогда
				ПредставлениеСрока = ПредставлениеСрока + " " + ТребованияФНС.ПредставлениеПросроченныхДней(Разница);
			Иначе
				ПредставлениеСрока = ПредставлениеСрока + " " + ТребованияФНС.ПредставлениеОставшихсяДней(-Разница);
			КонецЕсли;
			ПредставлениеСрока = ПредставлениеСрока + "."
		КонецЕсли;
	КонецЕсли;

	ПредставлениеДокументов = "<span style=""font:ШрифтЗаголовкаНаклонныйБРО"">" + НСтр("ru = 'Подготовка платежного документа'") + "</span>"
									+ Символы.ПС;
	
	Если КоличествоПлатежек > 0 Тогда
		Если КоличествоПлатежек > 1 Тогда
			ПредставлениеДокументов = "<span style=""font:ШрифтЗаголовкаНаклонныйБРО"">" + НСтр("ru = 'Подготовка платежных документов'") + "</span>"
									+ Символы.ПС;
		КонецЕсли;
		
		ВсеДокументы = ПолучитьСсылкиПлатежныхПоручений();
		ШаблонДокумента = ?(Платежи.Количество() > 0, "   ", "") + "<a href=""%1"">%2</a>";
		
		Для Каждого СтрокаМассива Из ВсеДокументы Цикл
			ПредставлениеДокументов = ПредставлениеДокументов + Символы.ПС + Символы.ПС
						+ СтрШаблон(ШаблонДокумента, СтрокаМассива.НавигационнаяСсылка, СтрокаМассива.ПредставлениеСсылки);
		КонецЦикла;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ДанныеТребования) Тогда
		ПредставлениеДокументов = НСтр("ru = 'Обработка содержимого требования'");
		
	КонецЕсли;
	
	ПодробностиОплаты = СтроковыеФункции.ФорматированнаяСтрока(Результат);
	Элементы.ДекорацияОжидание.Видимость = НЕ ЗначениеЗаполнено(ДанныеТребования);
	Элементы.ДекорацияПлатежки.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(ПредставлениеДокументов);
	Элементы.ДекорацияПлатежки.Видимость = ЗначениеЗаполнено(ПредставлениеДокументов);
	Элементы.Платежи.Видимость = Платежи.Количество() > 0;
	Элементы.СформироватьПлатеж.Видимость = Платежи.Количество() > 0;
	Элементы.СформироватьПлатеж.Доступность = Платежи.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество() > 0;
	Элементы.ВыгрузитьПлатеж.Видимость = ВыгрузкаПлатежныхПоручений И КоличествоПлатежек > 0;
	Элементы.ДекорацияСрокОплаты.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(ПредставлениеСрока);
	Элементы.ДекорацияСрокОплаты.Видимость = ЗначениеЗаполнено(ПредставлениеСрока);
	Элементы.ПлатежиПометка.Видимость = Платежи.Количество() > 1 ИЛИ КоличествоПлатежек > 0;
	Элементы.Платежи.ВысотаВСтрокахТаблицы = Платежи.Количество();
	Элементы.ОплатаПроизведена.Видимость = КоличествоПлатежек = 0;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьПредставлениеУплаты(СуммаУплаты, ВыбраннаяСумма = Неопределено)
	
	Результат = "";
	
	Если ЗначениеЗаполнено(СуммаУплаты) Тогда
		Результат =  НСтр("ru = 'Общая сумма:'") + " <b>" + Формат(Цел(СуммаУплаты), "ЧЦ=15; ЧН=00") 
		+ НСтр("ru = ' руб. '") + Формат(СуммаУплаты % 1 * 100, "ЧЦ=2; ЧН=00")
		+ НСтр("ru = ' коп. '") + "</b>";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаписатьИзмененияТребования(СохранитьДанныеТребования, ОплатаУжеЕсть)

	ЗаписатьДанныеТребования(СохранитьДанныеТребования, ОплатаУжеЕсть);
	ИзвлечьДанныеТребования();
	ОформитьСрокиПредставления();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьДанныеТребования(СохраненныеДанные)

	Если СохраненныеДанные = Неопределено Тогда
		ДанныеТребования = "Ошибка";
		Возврат;
	Иначе
		ДанныеТребования = ПодготовитьДанныеТребованияУплаты(СохраненныеДанные);
		Для Каждого СтрокаМассива Из ДанныеТребования.КБК Цикл
			Если СтрокаМассива.Сумма = 0 Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СтрокаМассива);
			НоваяСтрока.Вставить("Пометка", Истина);
			ДанныеТребования.Платежи.Добавить(НоваяСтрока);
		КонецЦикла;
		ЗаписатьДанныеТребования(ДанныеТребования);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеТребования(СохранитьДанныеТребования = Неопределено, ОплатаУжеЕсть = Неопределено)
	
	ЗаписьТребования = Новый ЗаписьJSON;
	ЗаписьТребования.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	НастройкаЗаписи = Новый НастройкиСериализацииJSON;
	НастройкаЗаписи.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	ЗаписатьJSON(ЗаписьТребования, СохранитьДанныеТребования, НастройкаЗаписи);
	ПоляРегистра = Новый Структура;
	Если СохранитьДанныеТребования <> Неопределено Тогда
		ПоляРегистра.Вставить("ДанныеТребования", ЗаписьТребования.Закрыть());
	КонецЕсли;
	Если ОплатаУжеЕсть <> Неопределено Тогда
		ПоляРегистра.Вставить("ОтветУжеДан", ОплатаУжеЕсть);
	КонецЕсли;

	ТребованияФНС.ОбновитьИнформациюВРегистреИзвлеченныеДанныеТребований(Объект.Ссылка, ПоляРегистра);
	
КонецПроцедуры

&НаСервере
Функция РаспознатьСодержимоеТребованияСервер(АдресДанных)
	
	Результат = Неопределено;
	
	Если ДанныеТребования = Неопределено Тогда
		ПараметрыОперации = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
		ПараметрыОперации.ОжидатьЗавершение = 30;
		Результат = ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыОперации, "ТребованияФНС.ИзвлечьДанныеТребованияИзPDF", 
							Новый Структура("Ссылка", Объект.Ссылка), АдресДанных);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьСсылкиПлатежныхПоручений()
	
	Результат = Новый Массив;
	
	МассивСсылок = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеТребования, "Ссылки");
	
	Если МассивСсылок <> Неопределено И МассивСсылок.Количество() > 0 Тогда
		ПолнаяСсылка = СтрРазделить(МассивСсылок[0], ";");

		Попытка
			МетаданныеОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолнаяСсылка[0]);
		Исключение
			Возврат Результат;
		КонецПопытки;
		
		ЕстьСумма = Ложь;
		ЕстьДокумент = Ложь;
		ЕстьПодсистема = ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПрефиксацияОбъектов");
		РеквизитыОбъекта = "Ссылка";
		Если МетаданныеОбъекта.ПустаяСсылка().Метаданные().Реквизиты.Найти("СуммаДокумента") <> Неопределено Тогда
			РеквизитыОбъекта = РеквизитыОбъекта + ",СуммаДокумента";
			ЕстьСумма = Истина;
		КонецЕсли;
		
		Если ОбщегоНазначения.ЭтоДокумент(МетаданныеОбъекта.ПустаяСсылка().Метаданные()) Тогда
			РеквизитыОбъекта = РеквизитыОбъекта + ",Дата,Номер";
			ЕстьДокумент = Истина;
		КонецЕсли;

		МодульПрефиксацияОбъектовКлиентСервер = Неопределено;
		Если ЕстьПодсистема Тогда
			МодульПрефиксацияОбъектовКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ПрефиксацияОбъектовКлиентСервер");
		КонецЕсли;
		
		Для Каждого СтрокаМассива Из МассивСсылок Цикл
			ПолнаяСсылка = СтрРазделить(СтрокаМассива, ";");
			НашлиСсылку = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(МетаданныеОбъекта.ПолучитьСсылку(Новый УникальныйИдентификатор(ПолнаяСсылка[1])), 
								РеквизитыОбъекта, Истина);
			
			Если ЗначениеЗаполнено(НашлиСсылку.Ссылка) Тогда
				НоваяСтрока = Новый Структура;
				Если ЕстьДокумент И ЕстьПодсистема Тогда
					ПредставлениеСсылки =  НСтр("ru = 'Платежное поручение'") + " "
							+ МодульПрефиксацияОбъектовКлиентСервер.НомерНаПечать(НашлиСсылку.Номер, Истина, Истина)
							+ НСтр("ru = ' от '") + Формат(НашлиСсылку.Дата, "ДФ=dd.MM.yyyy; ДЛФ=D");
				Иначе
					ПредставлениеСсылки = СокрЛП(НашлиСсылку.Ссылка);
				КонецЕсли;
				ПредставлениеСсылки = ПредставлениеСсылки + ?(ЕстьСумма, НСтр("ru = ' на сумму '") + Формат(НашлиСсылку.СуммаДокумента, "ЧЦ=15; ЧДЦ=2") + НСтр("ru = ' руб.'"), "");
				НоваяСтрока.Вставить("ПредставлениеСсылки", ПредставлениеСсылки);
				НоваяСтрока.Вставить("НавигационнаяСсылка", НСтр("ru = 'ПлатежноеПоручениеФорма'") + Формат(Результат.Количество(), "ЧЦ=10; ЧН=; ЧГ=0"));
				НоваяСтрока.Вставить("Ссылка", НашлиСсылку.Ссылка);
				Результат.Добавить(НоваяСтрока);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПодготовитьДанныеТребованияУплаты(СохраненныеДанные)
	
	Результат = ОбработкаФайловPDF.ДанныеОплатыТребования();
	Результат.Вставить("Ссылки", Новый Массив);
	Результат.Вставить("Платежи", Новый Массив);
	ЗаполнитьЗначенияСвойств(Результат, СохраненныеДанные);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ИзвлечьДанныеТребования()
	
	Если НЕ ЭтоТребованиеУплаты Тогда
		Возврат;
	КонецЕсли;
	
	Состояние = ТребованияФНС.РасширенноеСостояниеПодтвержденияИОтвета(Объект.Ссылка, ТекущаяДатаСеанса());
	ТекущиеДанные = Состояние.ДанныеТребования;
	
	Если НЕ ПустаяСтрока(ТекущиеДанные) Тогда
		ОплатаПроизведена = Состояние.ОтветУжеДан;

		Попытка
			ЧтениеТребования = Новый ЧтениеJSON;
			ЧтениеТребования.УстановитьСтроку(ТекущиеДанные);
			СохраненныеДанные = ПрочитатьJSON(ЧтениеТребования, , "ДатаПлатежа", ФорматДатыJSON.ISO);
			ДанныеТребования = ПодготовитьДанныеТребованияУплаты(СохраненныеДанные);
		Исключение
			ДанныеТребования = "Ошибка";
		КонецПопытки;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеТребования) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	МассивПлатежей = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеТребования, "Платежи");
	
	Платежи.Очистить();
	
	Если МассивПлатежей <> Неопределено Тогда
		Для Каждого СтрокаМассива Из МассивПлатежей Цикл
			НоваяСтрока = Платежи.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМассива);
			НоваяСтрока.ПредставлениеСумма = Формат(НоваяСтрока.Сумма, "ЧЦ=15; ЧДЦ=2");
			НоваяСтрока.Представление = " КБК " + НоваяСтрока.КБК;
			НоваяСтрока.НомерВМассиве = МассивПлатежей.Найти(СтрокаМассива);
			Если ЗначениеЗаполнено(НоваяСтрока.ОКТМО) И НоваяСтрока.ОКТМО <> "0" Тогда
				НоваяСтрока.Представление = НоваяСтрока.Представление + ", ОКТМО " + НоваяСтрока.ОКТМО;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ПолучитьМассивОписанийФайловВложений(МассивИменВложений)
	
	МассивОписаний = Новый Массив;
	
	Для Каждого ИмяВложения Из МассивИменВложений Цикл 
		Результат = ПолучитьВложениеНаСервере(ИмяВложения);
		Если ЗначениеЗаполнено(Результат.АдресДанных) Тогда 
			ОписаниеФайла = Новый ОписаниеПередаваемогоФайла(ИмяВложения, Результат.АдресДанных); 
			МассивОписаний.Добавить(ОписаниеФайла);
		КонецЕсли;	
	КонецЦикла;
	
	Возврат МассивОписаний;
	
КонецФункции

&НаСервере
Функция ПрорисоватьСтатус()
	
	ПараметрыПрорисовкиПанелиОтправки = ДокументооборотСКОВызовСервера.ПараметрыПрорисовкиПанелиОтправки(Объект.Ссылка, Объект.Организация, "ФНС");
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ПрименитьПараметрыПрорисовкиПанелиОтправки(ЭтаФорма, ПараметрыПрорисовкиПанелиОтправки);
	
	Элементы.ОтступПередКнопкойОбновитьОтправку.Видимость = Истина;
	
	Элементы.ЗаголовокНеотправленныхСообщений.Заголовок = 
		НСтр("ru = 'Оператору не отправлено извещение о получении документа'");
		
	Элементы.ГиперссылкаОтветы.Видимость = ВидимостьСсылкиОтветов();
		
	ТребованияФНС.ИзменитьОформлениеПанелиПриема(ЭтотОбъект, Объект.Ссылка);

	ВывестиСтатусыИВыжныеСообщенияНаФормуНаСервере();

	Возврат ПараметрыПрорисовкиПанелиОтправки;
	
КонецФункции

&НаСервере
Функция ВидимостьСсылкиОтветов() Экспорт
	
	Ответы = ТребованияФНС.ОтветыНаТребование(Объект.Ссылка);
	Видимость = Ответы.Количество() > 0;
	
	Возврат Видимость;
	
КонецФункции

&НаСервере
Процедура ОпределитьВидДокумента(КонтекстЭДОСервер)
	
	ЕстьПлатежноеПоручение = Ложь;
	ВыгрузкаПлатежныхПоручений = Ложь;
	ДокументооборотСКОПереопределяемый.КонфигурацияПоддерживаетПлатежныеПоручения(ЕстьПлатежноеПоручение, ВыгрузкаПлатежныхПоручений);
	
	ЭтоТребованиеОПредставленииДокументов = 
		Объект.ВидДокумента = Перечисления.ВидыНалоговыхДокументов.ТребованиеОПредставленииДокументов;
		
	ЭтоТребованиеОПредставленииПояснений = 
		Объект.ВидДокумента = Перечисления.ВидыНалоговыхДокументов.ТребованиеОПредставленииПоясненийКДекларацииНДС;
		
	ЭтоТребованиеФНС = ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.ЭтоТребованиеФНС(Объект.Ссылка);
	ЭтоТребованиеУплаты = ЕстьПлатежноеПоручение И ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.СодержитТребованиеУплаты(Объект.Ссылка);
	ЭтоРешениеПоЖалобе = Объект.ВидДокумента = Перечисления.ВидыНалоговыхДокументов.РешениеПоЖалобе;
	ЭтоКвитанцияОПрисвоенииРНПТ = (Объект.ВидДокумента = Перечисления.ВидыНалоговыхДокументов.КвитанцияОПрисвоенииРНПТ);
	
	ВТребованииЕстьXMLФайл = КонтекстЭДОСервер.ЕстьТребованияКРазделам8_12(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеЭУ()
	
	КонтекстЭДОСервер = ДокументооборотСКО.ПолучитьОбработкуЭДО();
	
	Заголовок = Объект.Наименование;
	
	Элементы.Тема.Заголовок = Заголовок;
	Элементы.ТекстПисьма.Заголовок = "Приложенные файлы:";
	Элементы.ВидРешенияНаЖалобу.Заголовок = Объект.ВидРешенияНаЖалобу;
	Элементы.ВидРешенияНаЖалобу.Видимость = ЗначениеЗаполнено(Объект.ВидРешенияНаЖалобу);
	Элементы.ГруппаКвитанцияОПрисвоенииРНПТ.Видимость = ЭтоКвитанцияОПрисвоенииРНПТ;
	Элементы.ГруппаРеквизитыСобственникаТовараЮЛ.Видимость = ЗначениеЗаполнено(Объект.НаименованиеСобственника);
	Элементы.ГруппаРеквизитыСобственникаТовараФЛ.Видимость = ЗначениеЗаполнено(Объект.ФИОСобственника);
	
	ПрорисоватьПриложения();
	
	ОписьВходящихДокументов = ДокументооборотСКОВызовСервера.ПолучитьОписьВходящихДокументовПоТребованию(Объект.Ссылка);
	
	Элементы.ГруппаСрокиПредставления.Видимость = ЭтоТребованиеФНС;
	Элементы.ГруппаОплаты.Видимость = ЭтоТребованиеУплаты;
	
	Если ЭтоТребованиеОПредставленииДокументов Тогда
		Элементы.СсылкаСроки.Видимость = Ложь;
		Элементы.ИнформацияСроки.Заголовок = 
			НСтр("ru = 'Обратите внимание на срок представления документов, указанный в приложенном файле'");
	КонецЕсли;
		
	Если ЭтоТребованиеОПредставленииПояснений Тогда
		
		Элементы.ИнформацияСроки.Заголовок = 
			НСтр("ru = 'Ответ на требование должен быть направлен в течение 5 дней с момента получения'");
			
	КонецЕсли;
	
	ДобавитьКнопкиОтветаНаСообщениеОНалоге();
	
	Элементы.ЗапроситьСверку.Видимость =
		Объект.ВидДокумента = Перечисления.ВидыНалоговыхДокументов.ТребованиеОбУплатеНалогаСбораПениШтрафа;
		
	Элементы.Печать.Видимость = ЭтоКвитанцияОПрисвоенииРНПТ;
	
	ПрорисоватьПодписанта();
	УстановитьПредставлениеДокументаОснования(КонтекстЭДОСервер);
	
	ОбновитьТекущееСостояниеДокумента();
	ОформитьСрокиПредставленияСервер();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКнопкиОтветаНаСообщениеОНалоге()

	Виды = Перечисления.ВидыНалоговыхДокументов;
	Вид  = Объект.ВидДокумента;

	ЭтоСообщениеОбИсчисленииИмущественныхНалогов = 
		(Вид = Виды.СообщениеОбИсчисленнойСуммеТранспортногоНалога
		Или Вид = Виды.СообщениеОбИсчисленнойСуммеТранспортногоИмущественногоЗемельногоНалогов
		Или Вид = Виды.СообщениеОбИсчисленнойСуммеЗемельногоНалога);

	РеализованаСверкаИмущественныхНалогов = Ложь;
	ДокументооборотСКОПереопределяемый.ПроверитьРеализованаСверкаИмущественныхНалогов(РеализованаСверкаИмущественныхНалогов);

	Если ЭтоСообщениеОбИсчисленииИмущественныхНалогов И РеализованаСверкаИмущественныхНалогов Тогда
		Элементы.ПерейтиКСверкеИмущественногоНалога.Видимость = Истина;
		Элементы.ПерейтиКСверкеИмущественногоНалога.КнопкаПоУмолчанию = Истина;
		// Скроем стандартную кнопку ответа
		Элементы.КомандаСоздатьОтвет.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПрорисоватьПриложения()
	
	Вложения.Очистить();
	
	ВсеВложенияТребования = ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.ПолучитьВложенияДокументовРеализацииПолномочийНалоговыхОрганов(Объект.Ссылка);
	
	// Для этих скрываем, но в некоторых случах надо показывать, 
	// например, для СообщениеОбИсчисленнойСуммеТранспортногоИмущественногоЗемельногоНалогов
	СкрытьXML = 
		ЭтоТребованиеОПредставленииПояснений 
		ИЛИ ЭтоРешениеПоЖалобе 
		ИЛИ ЭтоКвитанцияОПрисвоенииРНПТ
		ИЛИ Объект.ВидДокумента = Перечисления.ВидыНалоговыхДокументов.РезультатыОбработкиДляСоциальногоВычета;
	
	Если СкрытьXML Тогда
		Для каждого ПриложениеТребования Из ВсеВложенияТребования Цикл
			
			СвойстваФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ПриложениеТребования.ИмяФайла);
			
			Если ВРЕГ(СвойстваФайла.Расширение) <> ВРЕГ(".xml") Тогда
				Вложения.Добавить(ПриложениеТребования);
			КонецЕсли;
		
		КонецЦикла;
	Иначе
		Вложения.ЗагрузитьЗначения(ВсеВложенияТребования);
	КонецЕсли;
	
	Элементы.Вложения.Заголовок = ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ФорматированноеПредставлениеСпискаВложений(Вложения.ВыгрузитьЗначения());
	
КонецФункции

&НаКлиенте
Процедура ПослеПодтвержденияПриемаИлиОтказаВПриеме(Результат, ВходящийКонтекст) Экспорт
	
	ОбновитьТекущееСостояниеДокумента();
	
	// Перерисовываем другие формы при необходимости
	ОповеститьОбОкончанииОтправки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОбОкончанииОтправки()
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Организация", Объект.Организация);
	ПараметрыОповещения.Вставить("Ссылка", 		Объект.Ссылка);
	
	Оповестить(РегламентированнаяОтчетностьКлиент.ИмяСобытияЗавершениеОтправки(), ПараметрыОповещения, Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПрорисоватьПодписанта()
	
	// Текст подсказки
	НалоговыйОрганПодсказка = СокрЛП(Объект.ПодписантДолжность + " " + Объект.ПодписантФИО);
	
	Если ЗначениеЗаполнено(Объект.ПодписантТелефон) Тогда
		ПодписантТелефон = НСтр("ru = 'тел: '") + Объект.ПодписантТелефон;
	Иначе
		ПодписантТелефон = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ПодписантПочта) Тогда
		ПодписантПочта = НСтр("ru = 'e-mail: '") + Объект.ПодписантПочта;
	Иначе
		ПодписантПочта = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПодписантТелефон) И ЗначениеЗаполнено(ПодписантПочта) Тогда
		КонтактныеДанныеПодписанта = ПодписантТелефон + ", " + ПодписантПочта;
	ИначеЕсли ЗначениеЗаполнено(ПодписантТелефон) Тогда
		КонтактныеДанныеПодписанта = ПодписантТелефон;
	Иначе
		КонтактныеДанныеПодписанта = ПодписантПочта;
	КонецЕсли;
	
	НалоговыйОрганПодсказка = СокрЛП(НалоговыйОрганПодсказка + Символы.ПС + КонтактныеДанныеПодписанта);
	
	Элементы.НалоговыйОрган.РасширеннаяПодсказка.Заголовок = НалоговыйОрганПодсказка;
	
	// Отображение подсказки
	Если ЗначениеЗаполнено(НалоговыйОрганПодсказка) Тогда
		Элементы.НалоговыйОрган.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	Иначе
		Элементы.НалоговыйОрган.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПредставлениеДокументаОснования(КонтекстЭДОСервер)
	
	// Представление
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		СведенияПоОбъекту = КонтекстЭДОСервер.СведенияПоОтправляемымОбъектам(Объект.ДокументОснование);
		ПредставлениеДокументаОснования = СведенияПоОбъекту.Наименование;
		
		Если НЕ ЗначениеЗаполнено(ПредставлениеДокументаОснования) Тогда
			ПредставлениеДокументаОснования = Строка(Объект.ДокументОснование);
		КонецЕсли;
	Иначе
		ПредставлениеДокументаОснования = "";
	КонецЕсли;
	
	// Видимость
	Элементы.ПредставлениеДокументаОснования.Видимость = 
		ЗначениеЗаполнено(Объект.ДокументОснование)
		И ЗначениеЗаполнено(ПредставлениеДокументаОснования);

КонецПроцедуры

&НаСервере
Функция ТабличныйДокументНО(ДокументНО)
	
	Возврат Справочники.ДокументыРеализацииПолномочийНалоговыхОрганов.ПечатнаяФорма(ДокументНО);
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстСообщения(Адрес)

	Возврат Справочники.ДокументыРеализацииПолномочийНалоговыхОрганов.ТекстСообщения(Адрес);

КонецФункции

&НаКлиенте
Процедура ПослеПодтвержденияЧтоЭДООбязателен(Результат, ВходящийКонтекст) Экспорт
	
	ИнициализироватьОбязательностьЭДО();
	УправлениеЭУ();
	
КонецПроцедуры

#Область ИнформацияПоТребованиям

&НаКлиенте
Процедура ИзменитьДатуОтветаЗавершение(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = Истина Тогда
		ОформитьСрокиПредставленияСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОформитьСрокиПредставления()
	
	Состояние = ТребованияФНС.РасширенноеСостояниеПодтвержденияИОтвета(Объект.Ссылка, Сейчас);
	
	Если Состояние.ЕстьДанные Тогда
	
		Если ЭтоТребованиеФНС Тогда
			ОформитьПредставлениеПодтверждения(Состояние);
			ОформитьПредставлениеОтвета(Состояние);
		КонецЕсли;
		
		Если ЭтоТребованиеУплаты Тогда
			ОформитьПредставлениеУплаты(Состояние);
		КонецЕсли;

		Элементы.НеУдалосьРазобратьPDF.Видимость = 
			НЕ Состояние.УдалосьРазобратьPDF
			И Элементы.ИзменитьДатуОтвета.Видимость
			И Не ЗначениеЗаполнено(Состояние.ДатаОтветаИзмененная)
			И ЭтоТребованиеОПредставленииДокументов
			И Состояние.ЕстьДанные;
		
		Элементы.НеЗаполненКалендарь.Видимость = Состояние.КалендарьБылНезаполнен;
		
	ИначеЕсли ЭтоТребованиеФНС Тогда
		
		Если ЭтоТребованиеОПредставленииДокументов Тогда
			Элементы.СсылкаСроки.Видимость = Ложь;
			Элементы.ИнформацияСроки.Заголовок = 
				НСтр("ru = 'Обратите внимание на срок представления документов, указанный в приложенном файле'");
		КонецЕсли;
			
		Если ЭтоТребованиеОПредставленииПояснений Тогда
			Элементы.ИнформацияСроки.Заголовок = 
				НСтр("ru = 'Ответ на требование должен быть направлен в течение 5 дней с момента получения'");
				
		КонецЕсли;
		
	КонецЕсли;
	
	ИнициализироватьОбязательностьЭДО();
	
	Элементы.ГруппаНаличиеДаты.Видимость = ЭтоТребованиеФНС И Состояние.ЕстьДанные И НЕ ОбязательностьЭДОНеОпределена;
	Элементы.ГруппаБезПарсинга.Видимость = НЕ ЭтоТребованиеФНС ИЛИ (НЕ Состояние.ЕстьДанные И НЕ ОбязательностьЭДОНеОпределена);
	
КонецПроцедуры

&НаСервере
Процедура ОформитьПредставлениеПодтверждения(Состояние)
	
	Результат = ТребованияФНС.ПредставлениеПодтверждения(Состояние, Сейчас);
	
	Элементы.ОгонекПодтверждения.Видимость = Результат.ДобавитьОгонек;
	
	Элементы.ДатаПриемаПредставление.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(Результат.Представление);
	
КонецПроцедуры

&НаСервере
Процедура ОформитьПредставлениеОтвета(Состояние)
	
	Результат = ТребованияФНС.ПредставлениеОтвета(Состояние, Сейчас);
	
	Элементы.ПоказатьОтветы.Видимость = Результат.ПоказатьОтветы;
	Элементы.ПоказатьОтветы.Заголовок = Результат.ПредставлениеСсылки;
	Элементы.ИзменитьДатуОтвета.Видимость = Состояние.Подтвержден И НЕ Состояние.ЕстьОтвет;
	Элементы.ОгонекОтвета.Видимость = Результат.ДобавитьОгонек;
	Элементы.ГруппаОшибокОтвета.Видимость = Состояние.ЕстьКритическаяОшибкаОтвета;
	
	Элементы.ДатаОтветаПредставление.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(Результат.Представление);

КонецПроцедуры

&НаСервере
Процедура ОформитьСрокиПредставленияСервер()
	
	КонтекстЭДОСервер = ДокументооборотСКО.ПолучитьОбработкуЭДО();
	СтатусОтправки = ДокументооборотСКОВызовСервера.ПараметрыПрорисовкиПанелиОтправки(Объект.Ссылка, Объект.Организация, "ФНС");
	ОформитьСрокиПредставления();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТекущееСостояниеДокумента()
	
	СтатусОтправки = ПрорисоватьСтатус();
	ОформитьСрокиПредставления();
	
КонецПроцедуры

&НаКлиенте
Процедура НеЗаполненКалендарьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Календарь = ТребованияФНСВызовСервера.ПроизводственныйКалендарь();
	ПоказатьЗначение(, Календарь);
	
КонецПроцедуры

&НаКлиенте
Процедура НеУдалосьРазобратьPDFОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("ИзменитьДатуОтветаЗавершение", ЭтотОбъект);
	ТребованияФНСКлиент.ИзменитьСрокТребования(Объект.Ссылка, ОповещениеЗавершения);
	ТекущийЭлемент = Элементы.Комментарий;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСвойстваОтветов(Команда)
	
	Парам = Новый Структура;
	Отбор = Новый Структура;
	Отбор.Вставить("Ссылка", Объект.Ссылка);
	Парам.Вставить("Отбор", Отбор);
	ОткрытьФорму("РегистрСведений.СвойстваОтветовНаТребования.ФормаСписка", Парам);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСвойстваТребования(Команда)
	
	Парам = Новый Структура;
	Отбор = Новый Структура;
	Отбор.Вставить("Ссылка", Объект.Ссылка);
	Парам.Вставить("Отбор", Отбор);
	ОткрытьФорму("РегистрСведений.ЖурналОтправокВКонтролирующиеОрганы.ФормаСписка", Парам);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыделениеСтроки()
	
	Элементы.Платежи.ТекущаяСтрока = -1;

КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ИнициализироватьВыводСтатусовИВажныхСообщений_85()

	Если РегламентированнаяОтчетность.ДоступнаПодсистема85() Тогда
		МодульЭДОСКонтролирующимиОрганами = ОбщегоНазначения.ОбщийМодуль("ЭлектронныйДокументооборотСКонтролирующимиОрганами");
		МодульЭДОСКонтролирующимиОрганами.УстановитьРазмещениеНаименованияЭтапаБРО_85(ЭтотОбъект);
		МодульЭДОСКонтролирующимиОрганами.ВывестиСтатусыИВыжныеСообщенияНаФорму_85(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВывестиСтатусыИВыжныеСообщенияНаФормуНаСервере() Экспорт

	Если РегламентированнаяОтчетность.ДоступнаПодсистема85() Тогда
		МодульЭДОСКонтролирующимиОрганами = ОбщегоНазначения.ОбщийМодуль("ЭлектронныйДокументооборотСКонтролирующимиОрганами");
		МодульЭДОСКонтролирующимиОрганами.ВывестиСтатусыИВыжныеСообщенияНаФорму_85(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДетальноеОписаниеСтатусаПослеВыбора(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если Результат = "ОбновитьОтправку" Тогда
		
		ОбновитьОтправку(Неопределено);
		
	ИначеЕсли Результат = "ГиперссылкаПротокол" Тогда 	
		
		ГиперссылкаПротоколНажатие(Неопределено);
		
	ИначеЕсли Результат = "ЭтапыОтправки" Тогда 	
		
		ЭтапыОтправкиНажатие(Неопределено);

	ИначеЕсли Результат = "ИзменитьНастройкиПодтверждения" Тогда 	
		
		КомментарийЭтапаОбработкаНавигационнойСсылки(Неопределено, Результат, Ложь);
		
	ИначеЕсли Результат = "КомандаПодтвердитьПрием" Тогда 	
		
		КомандаПодтвердитьПрием(Неопределено); 
		
	ИначеЕсли Результат = "ПодтвердитьЧтоЭДООбязателен" Тогда 	
		
		ПодтвердитьЧтоЭДООбязателен(Неопределено); 	
		
	ИначеЕсли Результат = "ПодтвердитьЧтоЭДОНеОбязателен" Тогда 	
		
		ПодтвердитьЧтоЭДОНеОбязателен(Неопределено); 	
			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВывестиСтатусыИВыжныеСообщенияНаФорму() Экспорт

	ВывестиСтатусыИВыжныеСообщенияНаФормуНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаНажатияКнопкиВВажномСообщении(Команда)

	Если Команда.Имя = "ОтправитьНеотправленноеИзвещение" Тогда
		ОтправитьНеотправленноеИзвещение(Неопределено);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаНавигационнойСсылкиВВажномСообщении(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Если НРег(НавигационнаяСсылкаФорматированнойСтроки) = "критическиеошибки" Тогда
		КритическиеОшибкиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаЗакрытияВажногоСообщения(Команда)

	МодульКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер");
	МодульКлиентСервер.ЗакрытьВажноеСообщение(ЭтотОбъект, Команда.Имя);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьДействиеИнформационногоСообщения(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)

	МодульОбщегоНазначенияКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОбщегоНазначенияКлиент");
	МодульОбщегоНазначенияКлиент.ОбработатьДействиеИнформационногоСообщения(ЭтотОбъект, ЭлементИлиКоманда, НавигационнаяСсылка, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура КакУзнать_Завершение(Результат, ВходящийКонтекст) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТребованияФНСКлиент.СохранитьРезультатВыбораЭДОДляСсылки(Объект.Ссылка, Результат);
	
	УправлениеЭУ();
	
	// Перерисовываем другие формы при необходимости
	ОповеститьОбОкончанииОтправки();
	
КонецПроцедуры

#КонецОбласти
